Revit 2027 API
BuiltInFailures.DimensionFailures.LockOverconstrained Property
 Locking this dimension would overconstrain the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LockOverconstrained { get; }
Public Shared ReadOnly Property LockOverconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LockOverconstrained {
	FailureDefinitionId^ get ();
}
static member LockOverconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace